AlmAck/svdtonuttx/demo/h/da1470_dsi2.h
/****************************************************************************
 * ./tmp/da1470_dsi2.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470_DSI2_H
#define __DA1470_DSI2_H

/* Register offsets *********************************************************/

#define DA1470_DSI2_DSI2_CFG_AUTOINSERT_EOTP_OFFSET                   0x0014 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_BTA_H_TO_COUNT_OFFSET                    0x0028 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_CLK_LANE_EN_OFFSET                       0x0060 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_CONTINUOUS_HS_CLK_OFFSET                 0x0004 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DATA_LANE_EN_OFFSET                      0x0064 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DISABLE_BURST_OFFSET                     0x0030 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DISBL_RX_CRC_CHECK_OFFSET                0x001C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_EXT_CMDS_AFT_EOTP_OFFSET                 0x0018 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_HTX_TO_COUNT_OFFSET                      0x0020 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_IRQ_MASK_OFFSET                          0x01A8 /* Status of APB to packet interface, reading will clear IRQ status 1 and 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_MASK2_OFFSET                         0x01AC /* Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_STATUS_OFFSET                        0x01A0 /* Status of APB to packet interface, reading will clear IRQ status 1 and 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_STATUS2_OFFSET                       0x01A4 /* Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2 */
#define DA1470_DSI2_DSI2_CFG_LRX_H_TO_COUNT_OFFSET                    0x0024 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_NUM_LANES_OFFSET                         0x0000 /* configure numer of active lanes */
#define DA1470_DSI2_DSI2_CFG_PACKET_CONTROL_OFFSET                    0x0184 /* Tx packet control register */
#define DA1470_DSI2_DSI2_CFG_PKT_RD_LEVEL_OFFSET                      0x0194 /* Read level of APB to pkt interface fifo */
#define DA1470_DSI2_DSI2_CFG_PKT_RX_HEADER_OFFSET                     0x019C /* Packet 2 APB RX header */
#define DA1470_DSI2_DSI2_CFG_PKT_RX_PAYLOAD_OFFSET                    0x0198 /* Packet 2 APB RX payload */
#define DA1470_DSI2_DSI2_CFG_PKT_STATUS_OFFSET                        0x018C /* Status of APB to packet interface */
#define DA1470_DSI2_DSI2_CFG_PKT_WR_LEVEL_OFFSET                      0x0190 /* Write level of APB to pkt interface fifo */
#define DA1470_DSI2_DSI2_CFG_RX_ERROR_STATUS_OFFSET                   0x0044 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_SEND_PACKET_OFFSET                       0x0188 /* Tx send packet */
#define DA1470_DSI2_DSI2_CFG_STATUS_OUT_OFFSET                        0x0040 /* Contains the status of the status register */
#define DA1470_DSI2_DSI2_CFG_TWAKEUP_OFFSET                           0x002C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_TX_GAP_OFFSET                            0x0010 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_TX_PAYLOAD_OFFSET                        0x0180 /* TX Payload data write register */
#define DA1470_DSI2_DSI2_CFG_T_POST_OFFSET                            0x000C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_T_PRE_OFFSET                             0x0008 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_BLLP_MODE_OFFSET                     0x0140 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_ENABLE_OFFSET                        0x0100 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HBP_OFFSET                           0x012C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HFP_OFFSET                           0x0128 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HSA_OFFSET                           0x0130 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HSYNC_POLARITY_OFFSET                0x0118 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_OVERRIDE_OFFSET                      0x0120 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PACKETS_P_LINE_OFFSET                0x0134 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_ALIGNMENT_OFFSET                 0x010C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_FORMAT_OFFSET                    0x0110 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_PAYLOAD_SIZE_OFFSET              0x0108 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_P_PACKET_OFFSET                  0x0104 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_START_DELAY_OFFSET                   0x0124 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_USE_NULL_PKT_BLLP_OFFSET             0x0144 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VACTIVE_OFFSET                       0x0148 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VBP_OFFSET                           0x0138 /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VC_OFFSET                            0x014C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VFP_OFFSET                           0x013C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VIDEO_MODE_OFFSET                    0x011C /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VSYNC_POLARITY_OFFSET                0x0114 /* No description available. */

