AlmAck/svdtonuttx/demo/h/da1470_dsi2.h
/* Register addresses *******************************************************/

#define DA1470_DSI2_BASE                                              0x51001300 /* DSI2 registers */

#define DA1470_DSI2_DSI2_CFG_AUTOINSERT_EOTP                          (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_AUTOINSERT_EOTP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_BTA_H_TO_COUNT                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_BTA_H_TO_COUNT_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_CLK_LANE_EN                              (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_CLK_LANE_EN_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_CONTINUOUS_HS_CLK                        (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_CONTINUOUS_HS_CLK_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DATA_LANE_EN                             (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_DATA_LANE_EN_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DISABLE_BURST                            (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_DISABLE_BURST_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_DISBL_RX_CRC_CHECK                       (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_DISBL_RX_CRC_CHECK_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_EXT_CMDS_AFT_EOTP                        (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_EXT_CMDS_AFT_EOTP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_HTX_TO_COUNT                             (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_HTX_TO_COUNT_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_IRQ_MASK                                 (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_IRQ_MASK_OFFSET) /* Status of APB to packet interface, reading will clear IRQ status 1 and 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_MASK2                                (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_IRQ_MASK2_OFFSET) /* Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_STATUS                               (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_IRQ_STATUS_OFFSET) /* Status of APB to packet interface, reading will clear IRQ status 1 and 2 */
#define DA1470_DSI2_DSI2_CFG_IRQ_STATUS2                              (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_IRQ_STATUS2_OFFSET) /* Status of APB to packet interface part 2, read part 2 first then dsi2 host irq 2 */
#define DA1470_DSI2_DSI2_CFG_LRX_H_TO_COUNT                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_LRX_H_TO_COUNT_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_NUM_LANES                                (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_NUM_LANES_OFFSET) /* configure numer of active lanes */
#define DA1470_DSI2_DSI2_CFG_PACKET_CONTROL                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PACKET_CONTROL_OFFSET) /* Tx packet control register */
#define DA1470_DSI2_DSI2_CFG_PKT_RD_LEVEL                             (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PKT_RD_LEVEL_OFFSET) /* Read level of APB to pkt interface fifo */
#define DA1470_DSI2_DSI2_CFG_PKT_RX_HEADER                            (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PKT_RX_HEADER_OFFSET) /* Packet 2 APB RX header */
#define DA1470_DSI2_DSI2_CFG_PKT_RX_PAYLOAD                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PKT_RX_PAYLOAD_OFFSET) /* Packet 2 APB RX payload */
#define DA1470_DSI2_DSI2_CFG_PKT_STATUS                               (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PKT_STATUS_OFFSET) /* Status of APB to packet interface */
#define DA1470_DSI2_DSI2_CFG_PKT_WR_LEVEL                             (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_PKT_WR_LEVEL_OFFSET) /* Write level of APB to pkt interface fifo */
#define DA1470_DSI2_DSI2_CFG_RX_ERROR_STATUS                          (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_RX_ERROR_STATUS_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_SEND_PACKET                              (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_SEND_PACKET_OFFSET) /* Tx send packet */
#define DA1470_DSI2_DSI2_CFG_STATUS_OUT                               (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_STATUS_OUT_OFFSET) /* Contains the status of the status register */
#define DA1470_DSI2_DSI2_CFG_TWAKEUP                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_TWAKEUP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_TX_GAP                                   (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_TX_GAP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_TX_PAYLOAD                               (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_TX_PAYLOAD_OFFSET) /* TX Payload data write register */
#define DA1470_DSI2_DSI2_CFG_T_POST                                   (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_T_POST_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_T_PRE                                    (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_T_PRE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_BLLP_MODE                            (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_BLLP_MODE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_ENABLE                               (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_ENABLE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HBP                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_HBP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HFP                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_HFP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HSA                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_HSA_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_HSYNC_POLARITY                       (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_HSYNC_POLARITY_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_OVERRIDE                             (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_OVERRIDE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PACKETS_P_LINE                       (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_PACKETS_P_LINE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_ALIGNMENT                        (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_PIX_ALIGNMENT_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_FORMAT                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_PIX_FORMAT_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_PAYLOAD_SIZE                     (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_PIX_PAYLOAD_SIZE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_PIX_P_PACKET                         (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_PIX_P_PACKET_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_START_DELAY                          (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_START_DELAY_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_USE_NULL_PKT_BLLP                    (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_USE_NULL_PKT_BLLP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VACTIVE                              (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VACTIVE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VBP                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VBP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VC                                   (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VC_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VFP                                  (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VFP_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VIDEO_MODE                           (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VIDEO_MODE_OFFSET) /* No description available. */
#define DA1470_DSI2_DSI2_CFG_VID_VSYNC_POLARITY                       (DA1470_DSI2_BASE + DA1470_DSI2_DSI2_CFG_VID_VSYNC_POLARITY_OFFSET) /* No description available. */

/* Register bit definitions *************************************************/

